In [1]:
import pandas as pd
import numpy as np
import plotly.express as px
import plotly.graph_objects as go

## Q(a)
    A global garment brand wants to open its store in (Delhi or Bangalore). They shortlisted the two most popular malls, one in each city. They will use the criterion for this selection to count the number of footsteps every week. They got data from electronic sensors of the malls and want to finalize which mall to select based on the significant difference between the two.

In [4]:
# creating a data frame of foot steps for 10 weeks

table_2 = [[2322,1987],[2344,2356],
            [3423,3444],[2342,3216],
            [4536,2324],[3444,4566],
            [4589,3301],[3339,2201],
            [4335,3205],[5656,5567]]
df = pd.DataFrame(table_2, columns = ['Mall_1','Mall_2'])

In [5]:
df

   Mall_1  Mall_2
0    2322    1987
1    2344    2356
2    3423    3444
3    2342    3216
4    4536    2324
5    3444    4566
6    4589    3301
7    3339    2201
8    4335    3205
9    5656    5567

In [16]:
# now we are making the index starting from 1 becouase the data is of weeks 
df.index += 1

In [17]:
df

    Mall_1  Mall_2
1     2322    1987
2     2344    2356
3     3423    3444
4     2342    3216
5     4536    2324
6     3444    4566
7     4589    3301
8     3339    2201
9     4335    3205
10    5656    5567

In [20]:
# checking the stats 
df.describe()

            Mall_1       Mall_2
count    10.000000    10.000000
mean   3633.000000  3216.700000
std    1131.756648  1129.648721
min    2322.000000  1987.000000
25%    2592.750000  2332.000000
50%    3433.500000  3210.500000
75%    4485.750000  3408.250000
max    5656.000000  5567.000000

In [31]:
df.sum()

Mall_1    36330
Mall_2    32167
dtype: int64

#### Visualing the foots walks of both the malls's

In [25]:
fig = go.Figure()
fig.add_trace(
    go.Scatter(x =df.index, y = df['Mall_1'],
                line = dict(color = 'cadetblue', width = 1.5),
                mode = "lines+markers",
                name = 'Mall_1'
                 )
)
fig.add_trace(
    go.Scatter(x = df.index,y = df['Mall_2'],
                line = dict(color = 'blue', width = 1.5),
                mode = "lines+markers",
                name = 'Mall_2'
                 )
)
fig.update_layout(title= "comparison of both mall's",
                xaxis_title='weeks',
                yaxis_title='foot walks',
                autosize=False,
                width=1500,
                height=700,
                template = "presentation")
fig.update_xaxes(showgrid=False)
fig.update_yaxes(showgrid=False)  
fig.update_xaxes(type='category')
fig.update_layout(hovermode="x")
fig.show()

In [34]:
fig = px.bar(df, x=df.index, y=['Mall_1', 'Mall_2'],
              barmode='group',text_auto=True,orientation='v',
             height=500,
             color_discrete_map={
        'some_group': 'red',
        'some_other_group': 'green'
    }

    )

fig.update_layout(title= "Foot steps of  both mall's",
                xaxis_title='weeks',
                yaxis_title='foot walks',
                autosize=False,
                template = "presentation")

fig.update_xaxes(type='category')
fig.update_layout(hovermode="x")
fig.show()

## Now we will check the ouliers in both the Malls's

In [37]:
fig = go.Figure()
fig.add_trace(go.Box(y=df['Mall_1'], name="Mall_1"))
fig.add_trace(go.Box(y=df['Mall_2'], name="Mall_2"))

fig.update_traces(boxpoints='outliers', jitter=0)
fig.update_layout(autosize=False,
                  width=1000,
                  height=500,
                  template = "presentation")
fig.update_xaxes(showgrid= False)
fig.update_yaxes(showgrid= False)  

fig.show()

### as we can see above MALL_2 Has some outliers
### mall_1 has been more consitant

#### so here the conculsion is 
    Mall_1 can be selected
    reasons for Selecting mall_1 are :
    * the mean visitors are more than the Mall_2
    * No outliers has been detected 
    * visitors are more consistant in Mall_1
    * total foot walks are more than the Mall_2
    * so by this we can conclude that Mall_1 is Better than Mall_2

# Part B has been already submitted in the previous pandas assignments

#### creating data frames

In [ ]:
# Student Master Table

table_1 = {'Student_id':['A001','A002','A003','A004','A005','A006','A007','A008','A009'],
           'DOB': ['02-11-2005','23-12-2005','04-08-2005','25-09-2005','06-12-2004','27-02-2005',
                    '01-01-2005','30-03-2003','30-12-2004']}
t1 = pd.DataFrame(table_1)

In [ ]:
t1

  Student_id         DOB
0       A001  02-11-2005
1       A002  23-12-2005
2       A003  04-08-2005
3       A004  25-09-2005
4       A005  06-12-2004
5       A006  27-02-2005
6       A007  01-01-2005
7       A008  30-03-2003
8       A009  30-12-2004

In [ ]:
# Student Result Table

table_2 = [['A001',56,60,59],['A002',77,58,76],
            ['A003',56,78,66],['A004',68,71,76],
            ['A005',87,69,59],['A006',67,66,49],
            ['A007',85,68,10],['A008',90,41,67],
            ['A009',78,67,66]]
t2 = pd.DataFrame(table_2, columns = ['Student_id','Math','Science','History'])

In [ ]:
t2

  Student_id  Math  Science  History
0       A001    56       60       59
1       A002    77       58       76
2       A003    56       78       66
3       A004    68       71       76
4       A005    87       69       59
5       A006    67       66       49
6       A007    85       68       10
7       A008    90       41       67
8       A009    78       67       66

In [ ]:
t1.dtypes

Student_id    object
DOB           object
dtype: object

In [ ]:
# Conveting the DOB to  Datetime Format

t1['DOB'] = pd.to_datetime(t1.DOB)

t1['DOB']

0   2005-02-11
1   2005-12-23
2   2005-04-08
3   2005-09-25
4   2004-06-12
5   2005-02-27
6   2005-01-01
7   2003-03-30
8   2004-12-30
Name: DOB, dtype: datetime64[ns]

#### Calculating the Student age from DOB

In [ ]:
# Creating a function to calculate the student age from DOB

def from_dob_to_age(born):
    today = datetime.date(2021,12,31)
    return today.year - born.year - ((today.month, today.day) < (born.month, born.day))

In [ ]:
# applying the fucntion to t1 : 'Student Master Table' DataFrame
t1['Age'] = t1['DOB'].apply(lambda x: from_dob_to_age(x))

In [ ]:
t1

  Student_id        DOB  Age
0       A001 2005-02-11   16
1       A002 2005-12-23   16
2       A003 2005-04-08   16
3       A004 2005-09-25   16
4       A005 2004-06-12   17
5       A006 2005-02-27   16
6       A007 2005-01-01   16
7       A008 2003-03-30   18
8       A009 2004-12-30   17

#### creating a new DataFrame from the two DataFrames

In [ ]:
# Using pd.merge to create a new dataframe by 'student id'

new_table = pd.merge(t1,t2, on = 'Student_id',how= 'left')

In [ ]:
new_table

  Student_id        DOB  Age  Math  Science  History
0       A001 2005-02-11   16    56       60       59
1       A002 2005-12-23   16    77       58       76
2       A003 2005-04-08   16    56       78       66
3       A004 2005-09-25   16    68       71       76
4       A005 2004-06-12   17    87       69       59
5       A006 2005-02-27   16    67       66       49
6       A007 2005-01-01   16    85       68       10
7       A008 2003-03-30   18    90       41       67
8       A009 2004-12-30   17    78       67       66

In [ ]:
# Dropping the DOB column

new_table.drop('DOB',axis = 1,inplace = True)
new_table

  Student_id  Age  Math  Science  History
0       A001   16    56       60       59
1       A002   16    77       58       76
2       A003   16    56       78       66
3       A004   16    68       71       76
4       A005   17    87       69       59
5       A006   16    67       66       49
6       A007   16    85       68       10
7       A008   18    90       41       67
8       A009   17    78       67       66

In [ ]:
# Calculating the percentage and assigning it to new column 'Percentage'

total = new_table['Math'] + new_table['Science'] + new_table['History']
new_table['Percentage'] = round(((total / 300) * 100),2)

In [ ]:
new_table

  Student_id  Age  Math  Science  History  Percentage
0       A001   16    56       60       59       58.33
1       A002   16    77       58       76       70.33
2       A003   16    56       78       66       66.67
3       A004   16    68       71       76       71.67
4       A005   17    87       69       59       71.67
5       A006   16    67       66       49       60.67
6       A007   16    85       68       10       54.33
7       A008   18    90       41       67       66.00
8       A009   17    78       67       66       70.33

In [ ]:
new_table.dtypes

Student_id     object
Age             int64
Math            int64
Science         int64
History         int64
Percentage    float64
dtype: object

In [ ]:
#creating a function to add the bonus percentage if the percentage is greater than 65

def bonus(row):
    if(row['Percentage'] > 65):
        return(row['Percentage'] + 5)
    else:
        return(row['Percentage'])

In [ ]:
# applying the fucntion 

new_table['Percentage'] = new_table.apply(bonus, axis =1)

In [ ]:
new_table

  Student_id  Age  Math  Science  History  Percentage
0       A001   16    56       60       59       58.33
1       A002   16    77       58       76       75.33
2       A003   16    56       78       66       71.67
3       A004   16    68       71       76       76.67
4       A005   17    87       69       59       76.67
5       A006   16    67       66       49       60.67
6       A007   16    85       68       10       54.33
7       A008   18    90       41       67       71.00
8       A009   17    78       67       66       75.33

In [ ]:
# creating a fucntion to update the student id if the percntage is less than 60 "replace the student_id from A TO X"

def update_student_id(row):
    if(row['Percentage'] < 60):
        return (row['Student_id'].replace("A", "X", 1))
    else:
        return (row['Student_id'])

In [ ]:
# applying the fucntion

new_table['Student_id'] = new_table.apply(update_student_id, axis =1)

In [ ]:
new_table

  Student_id  Age  Math  Science  History  Percentage
0       X001   16    56       60       59       58.33
1       A002   16    77       58       76       75.33
2       A003   16    56       78       66       71.67
3       A004   16    68       71       76       76.67
4       A005   17    87       69       59       76.67
5       A006   16    67       66       49       60.67
6       X007   16    85       68       10       54.33
7       A008   18    90       41       67       71.00
8       A009   17    78       67       66       75.33